Infineon/IMR_PSoC6_BMS/proj_cm4/BMS_TLE9012/tle9012_registers.h
/*
 * tle9012_registers.h
 *
 *	Library for TLE9012 Li-Ion battery monitoring and balancing system IC. See main file Lib_TLE9012.c for how to use guide
 *	Created by R. Santeler @ Infineon 2024
 *
*******************************************************************************
 * (c) (2024), Cypress Semiconductor Corporation (an Infineon company) or an affiliate of Cypress Semiconductor Corporation.  All rights reserved.
 * This software, including source code, documentation and related materials ("Software") is owned by Cypress Semiconductor Corporation or one of its affiliates ("Cypress") and is protected by and subject to worldwide patent protection (United States and foreign), United States copyright laws and international treaty provisions.  Therefore, you may use this Software only as provided in the license agreement accompanying the software package from which you obtained this Software ("EULA").
 * If no EULA applies, Cypress hereby grants you a personal, non-exclusive, non-transferable license to copy, modify, and compile the Software source code solely for use in connection with Cypress's integrated circuit products.  Any reproduction, modification, translation, compilation, or representation of this Software except as specified above is prohibited without the express written permission of Cypress.
 * Disclaimer: THIS SOFTWARE IS PROVIDED AS-IS, WITH NO WARRANTY OF ANY KIND, EXPRESS OR IMPLIED, INCLUDING, BUT NOT LIMITED TO, NONINFRINGEMENT, IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE. Cypress reserves the right to make changes to the Software without notice. Cypress does not assume any liability arising out of the application or use of the Software or any product or circuit described in the Software. Cypress does not authorize its products for use in any products where a malfunction or failure of the Cypress product may reasonably be expected to result in significant property damage, injury or death ("High Risk Product"). By including Cypress's product in a High Risk Product, the manufacturer of such system or application assumes all risk of such use and in doing so agrees to indemnify Cypress against all liability.
*******************************************************************************/

#ifndef TLE9012_REGISTERS_H__
#define TLE9012_REGISTERS_H__

//#pragma once

#include <stdint.h>


//****************************************************************************
// Settings
//****************************************************************************
// Number of nodes that shall be initialized. This must match exactly the number of TLE9012 Nodes that are to be addressed
#define TLE9012_NODES_SIZE 				1
// Defines the minimum time in ms that must pass between watchdog refreshes, used to keep the ICs alive.
// Note: Per default the ICs can go to sleep when they did not receive a update after 1.8 seconds.
//       However the here mentioned time must take the maximum time between tle9012_manageQueue() executions into account (time between main loops).
#define TLE9012_WATCHDOG_REFRESH_TIME 	1300
#define TLE9012_WATCHDOG_MAXIMUM_TIME 	1755

// Conversion Settings
#define BVM_FSR             60.0				// V. Full scale range
#define BVM_BIT_DIVIDER  65536.0 				// 2^result_bits - If result precision is changed this must also be changed. see datasheet/manual
#define PCVM_FSR             5.0				// V. Full scale range
#define PCVM_BIT_DIVIDER 65536.0 				// 2^result_bits - If result precision is changed this must also be changed. see datasheet/manual
#define CELL_OVUV_LSB		 0.0048828125		// =(TEMP_FSR / 2^10). LSB used to set cell over and undervoltage thresholds. E.g. OL_OV_THR = 4.6/CELL_OVUV_LSB
#define TEMP_INT_LSB		 0.6624				// TMP internal temperature resolution in Kelvin
#define TEMP_FSR   		  	 2.0 				// V. Full scale range
#define TEMP_R   		   100.0 				// Ohm. Base resistance of e.g.: PT100. see datasheet/manual
#define TEMP_INTC            1.0
#define TEMP_DENOMINATOR     0.32768			// =(2^10 * 320*10^-6)	   see datasheet/manual
#define SCVM_FSR             5.0				// V. Full scale range
#define COMP_FSR             5.0				// V. Full scale range
#define BAVM_FSR             2.0				// V. Full scale range
#define AVM_FSR              2.0				// V. Full scale range

//****************************************************************************
// Global flags
//****************************************************************************
extern uint8_t tle9012_problemDetected;  // Used to check if an action was successful (e.g. switchON()) and if failure flags are set
extern uint8_t generalDiagnosticProblemDetected;

//****************************************************************************
// Definitions
//****************************************************************************
#define NUM_REGISTERS 64 		// Number of registers
#define NUM_SUBREGISTERS 200	// Number of sub-registers in all registers

// Representation item of each TLE9012 IC management, state, register data and converted values
typedef struct {
	//****************************************************************************
	// The node ID of the TLE9012 node - must be in order inside array starting with 1
	//****************************************************************************
	uint8_t ID;
	//****************************************************************************
	// Time in us when the last command was send to this node
	//****************************************************************************
	uint32_t timeLastCommandSent;
	//****************************************************************************
	// Data buffer for each register - shadow registers
	//****************************************************************************
	uint16_t reg_data[NUM_REGISTERS];
	//****************************************************************************
	// Register ready/error bitmap - Every bit of these maps represents if the related register
	// index is ready and without error
	//		if command is queued - ready is set to 0 until result has been received or timeout occurred
	//		if command failed or CRC was not correct - the error bit is set
	//****************************************************************************
	uint64_t reg_items_ready_bitmap;
	uint64_t reg_items_error_bitmap;
	uint64_t reg_items_queued_bitmap;
	//****************************************************************************
	// converted results from reg_data
	//****************************************************************************
	//uint32_t multi_read_cfg_bitmap;
	//****************************************************************************
	// converted results from reg_data
	//****************************************************************************
	uint16_t cell_voltages[12]; 	// mV
	double block_voltage;			//  V
	double temperatures[5];			//  C
	double temperaturesInternal[2]; //  C
} tle9012_node;

