Infineon/IMR_PSoC6_BMS/proj_cm4/BMS_TLE9012/tle9012_registers.h
typedef struct {
    uint16_t address;
    char* name;
} reg_item;

typedef struct {
    uint8_t  reg_index;
    uint16_t mask;
    char* name;
} subreg_item;

//****************************************************************************
// Objects
//****************************************************************************
// Combined objects of all register and subregister objects
extern reg_item  reg_items[NUM_REGISTERS];      // Array of register addresses and names
extern const subreg_item* subreg_items[NUM_SUBREGISTERS]; // Array of subregister addresses, masks, and names (combines all predefined subreg_items to make the iterable)
// Array of all nodes, holden all data of a node (shadow registers, bitmaps, conversion results, etc)
extern tle9012_node tle9012_nodes[TLE9012_NODES_SIZE];
extern uint8_t multi_read_cfg_reg_idx_list[23];
extern uint8_t multi_read_cfg_reg_idx_list_num;
// Time (ms) of the last refresh of the watchdog counter. If the time difference exceeds WD maximum interval the device will go to sleep
extern uint32_t timeLastWatchdogRefresh;


//****************************************************************************
// Predefined Communication Frames
//****************************************************************************
#define FRAME_WAKE	 		0xAA
#define FRAME_SYNC 			0x1E
#define FRAME_ID_READ 		0b00000000	// Template for a ID frame to read a register. Actual device ID must be added e.g. via or command
#define FRAME_ID_WRITE 		0b10000000	// Template for a ID frame to write a register. Actual device ID must be added e.g. via or command
#define FRAME_ID_BROADCAST 	0b00111111	// Template for a ID frame to execute a broadcast. Read/write bit must be added e.g. via or command


//****************************************************************************
// Macro definition of register names to indexes - These shall be used whenever a reg_index parameter is given
//****************************************************************************
#define  PART_CONFIG 0 					  // 0001H Partitioning config [supplied in sleep)
#define  OL_OV_THR 1 					  // 0002H Cell voltage thresholds [supplied in sleep)
#define  OL_UV_THR 2 					  // 0003H Cell voltage thresholds [supplied in sleep)
#define  TEMP_CONF 3 					  // 0004H Temperature measurement configuration [supplied in sleep)
#define  INT_OT_WARN_CONF 4 			  // 0005H Internal temperature measurement configuration [supplied in sleep)
#define  RR_ERR_CNT 5 					  // 0008H Round robin ERR counters [supplied in sleep)
#define  RR_CONFIG 6 					  // 0009H Round robin configuration [supplied in sleep)
#define  FAULT_MASK 7 					  // 000AH ERR pin / EMM mask [supplied in sleep)
#define  GEN_DIAG 8 					  // 000BH General diagnostics [supplied in sleep)
#define  CELL_UV 9 						  // 000CH Cell voltage supervision warning flags UV [supplied in sleep)
#define  CELL_OV 10 					  // 000DH Cell voltage supervision warning flags OV [supplied in sleep)
#define  EXT_TEMP_DIAG 11 				  // 000EH External overtemperature warning flags [supplied in sleep)
#define  DIAG_OL 12 					  // 0010H Diagnostics open load [supplied in sleep)
#define  REG_CRC_ERR 13 				  // 0011H REG_CRC_ERR [supplied in sleep)
#define  CELL_UV_DAC_COMP 14 			  // 0012H Cell voltage supervision warning flags UV [supplied in sleep)
#define  CELL_OV_DAC_COMP 15 			  // 0013H Cell voltage supervision warning flags OV [supplied in sleep)
#define  OP_MODE 16 					  // 0014H Operation mode
#define  BAL_CURR_THR 17 				  // 0015H Balancing current thresholds
#define  BAL_SETTINGS 18 				  // 0016H Balance settingsONi (i=0-11) i rwh Switching state of balancing switch i
#define  AVM_CONFIG 19 					  // 0017H Auxiliary voltage measurement configuration
#define  MEAS_CTRL 20 					  // 0018H Measurement control
#define  PCVM_0 21 						  // 0019H Primary cell voltage measurement i
#define  PCVM_1 22 						  // 0020H Primary cell voltage measurement i
#define  PCVM_2 23 						  // 0021H Primary cell voltage measurement i
#define  PCVM_3 24 						  // 0022H Primary cell voltage measurement i
#define  PCVM_4 25 						  // 0023H Primary cell voltage measurement i
#define  PCVM_5 26 						  // 0024H Primary cell voltage measurement i
#define  PCVM_6 27 						  // 0025H Primary cell voltage measurement i
#define  PCVM_7 28 						  // 0026H Primary cell voltage measurement i
#define  PCVM_8 29 						  // 0027H Primary cell voltage measurement i
#define  PCVM_9 30 						  // 0028H Primary cell voltage measurement i
#define  PCVM_10 31 					  // 0029H Primary cell voltage measurement i
#define  PCVM_11 32 					  // 0030H Primary cell voltage measurement i
#define  SCVM_HIGH 33 					  // 0025H SCVM highest cell voltage
#define  SCVM_LOW 34 					  // 0026H SCVM lowest cell voltage
#define  STRESS_PCVM 35 				  // 0027H Stress correction PCVM
#define  BVM 36 						  // 0028H Block voltage measurement
#define  EXT_TEMP_0 37 					  // 0029H Temp result 0
#define  EXT_TEMP_1 38 					  // 002AH Temp result 1
#define  EXT_TEMP_2 39 					  // 002BH Temp result 2
#define  EXT_TEMP_3 40 					  // 002CH Temp result 3
#define  EXT_TEMP_4 41 					  // 002DH Temp result 4
#define  EXT_TEMP_R_DIAG 42 			  // 002FH Temp result R diagnose
#define  INT_TEMP 43 					  // 0030H Chip temperature
#define  MULTI_READ 44 					  // 0031H Multiread command
#define  MULTI_READ_CFG 45 				  // 0032H Multiread configuration (This register must be written with a broadcast write command)
#define  BAL_DIAG_OC 46 				  // 0033H Passive balancing diagnostics OVERCURRENT
#define  BAL_DIAG_UC 47 				  // 0034H Passive balancing diagnostics UNDERCURRENT
#define  INT_TEMP_2 48 					  // 0035H Chip temperature 2
#define  CONFIG_MAIN 49 				  // 0036H Configuration  (added _MAIN because of name conflicts)
#define  GPIO_MAIN 50 					  // 0037H General purpose input / output (added _MAIN because of name conflicts)
#define  GPIO_PWM 51 					  // 0038H PWM settings
#define  ICVID 52 						  // 0039H IC version and manufacturing ID
#define  MAILBOX 53 					  // 003AH Mailbox register
#define  CUSTOMER_ID_0 54 				  // 003BH Customer ID 0
#define  CUSTOMER_ID_1 55 				  // 003CH Customer ID 1
#define  WDOG_CNT 56 					  // 003DH Watchdog counter
#define  SCVM_CONFIG 57 				  // 003EH SCVM configuration
#define  STRESS_AUX 58 					  // 003FH Stress correction AUX
#define  BAL_PWM 59 					  // 005BH Balancing PWM
#define  BAL_CNT_0 60 					  // 005CH Balancing counter register 0
#define  BAL_CNT_1 61 					  // 005DH Balancing counter register 1
#define  BAL_CNT_2 62 					  // 005EH Balancing counter register 2
#define  BAL_CNT_3 63 					  // 005FH Balancing counter register 3



//****************************************************************************
// Macro definition of subregister items and settings - These shall be used whenever a subreg or setting parameter is given
//****************************************************************************
// PART_CONFIG - 0001H Partitioning config [supplied in sleep)
extern const subreg_item  PART_CONFIG__EN_CELLi; 					// RW - Enable cell monitoring for cell i
    #define EN_CELLi__NO_CELL_ATTACHED		 0b0000000000000000	// No cell attached (default) 
    #define EN_CELLi__CELL_ATTACHED			 0b0000010000000000	// Cell attached 
extern const subreg_item  PART_CONFIG__EN_CELL11; 					// RW - Enable cell monitoring for cell 11
    #define EN_CELL11__NO_CELL_ATTACHED		 0b0000000000000000	// No cell attached 
    #define EN_CELL11__CELL_ATTACHED		 0b0000100000000000	// Cell attached (default) 

// OL_OV_THR - 0002H Cell voltage thresholds [supplied in sleep)
extern const subreg_item  OL_OV_THR__OV_THR; 						// RW - Overvoltage fault threshold 10-bit overvoltage fault threshold. Battery input voltages (U0 to U11)are tested for overvoltage with given value. OV error is detected andindicated in GEN_DIAG register if cell voltage is higher than OV faultthreshold.
    #define OV_THR__THRESHOLD				 0b0000001111111111	// Threshold (default) 
extern const subreg_item  OL_OV_THR__OL_THR_MAX; 					// RW - Open load maximum voltage drop threshold (LSB8) 6-bit (LSB8) to define the maximum threshold for the voltage dropwhile OL-diagnostics (I OL_DIAG * R F). If voltage drop > OL_THR_MAX, theOLx bit of channel x is set.
    #define OL_THR_MAX__THRESHOLD			 0b1111110000000000	// Threshold (default) 

// OL_UV_THR - 0003H Cell voltage thresholds [supplied in sleep)
extern const subreg_item  OL_UV_THR__UV_THR; 						// RW - Undervoltage fault threshold 10-bit undervoltage fault threshold. Battery input voltages (U0 to U11)are tested for undervoltage with given value. UV error is detected andindicated in GEN_DIAG register if cell voltage is lower than UV faultthreshold.
    #define UV_THR__THRESHOLD				 0b0000000000000000	// Threshold (default) 
extern const subreg_item  OL_UV_THR__OL_THR_MIN; 					// RW - Open load minimum voltage drop threshold (LSB8) 6-bit (LSB8) to define the minimum threshold for the voltage drop whileOL-diagnostics (I OL_DIAG * R F). If voltage drop < OL_THR_MIN, the OLxbit of channel x is set.
    #define OL_THR_MIN__THRESHOLD			 0b0000000000000000	// Threshold (default) 

// TEMP_CONF - 0004H Temperature measurement configuration [supplied in sleep)
extern const subreg_item  TEMP_CONF__EXT_OT_THR; 					// RW - External overtemperature threshold 10-bit overtemperature fault threshold. Overtemperature error isdetected and indicated in GEN_DIAG register if the externaltemperature result is lower than the fault threshold. Balancing isdeactivated.
    #define EXT_OT_THR__THRESHOLD			 0b0000000000000000	// Threshold (default) 
extern const subreg_item  TEMP_CONF__I_NTC; 						// RW - Current source used for OT fault
    #define I_NTC__I_0						 0b0000000000000000	// ITMPz_0 used (default) 
    #define I_NTC__I_1						 0b0000010000000000	// ITMPz_1 used 
    #define I_NTC__I_2						 0b0000100000000000	// ITMPz_2 used 
    #define I_NTC__I_3						 0b0000110000000000	// ITMPz_3 used 
extern const subreg_item  TEMP_CONF__NR_TEMP_SENSE; 				// RW - Number of external temperature sensors
    #define NR_TEMP_SENSE__NO_EXT_SENSOR	 0b0000000000000000	// No external TMP sensor (default) 
    #define NR_TEMP_SENSE__TMP0				 0b0001000000000000	// TMP0 active 
    #define NR_TEMP_SENSE__TMP0_1			 0b0010000000000000	// TMP0 + TMP1 active 
    #define NR_TEMP_SENSE__TMP0_2			 0b0011000000000000	// TMP0 + TMP1 + TMP2 active 
    #define NR_TEMP_SENSE__TMP0_3			 0b0100000000000000	// TMP0 + TMP1 + TMP2 + TMP3 active 
    #define NR_TEMP_SENSE__TMP0_4			 0b0101000000000000	// TMP0 + TMP1 +TMP2 + TMP3 + TMP4 active 

// INT_OT_WARN_CONF - 0005H Internal temperature measurement configuration [supplied in sleep)
extern const subreg_item  INT_OT_WARN_CONF__INT_OT_THR; 			// RW - Internal overtemperature threshold 10-bit overtemperature fault threshold. Overtemperature error isdetected and indicated in GEN_DIAG register if the internal temperatureresult is LOWER than the fault threshold. Balancing is deactivated.
    #define INT_OT_THR__THRESHOLD			 0b0000000000000000	// Threshold (default) 

// RR_ERR_CNT - 0008H Round robin ERR counters [supplied in sleep)
extern const subreg_item  RR_ERR_CNT__NR_ERR; 						// RW - Number of errors Number of consecutive detected errors before error is valid and setin GEN_DIAG and individual fault registers. Only used for faults wherecounter NR_ERR is active (this can be set in register NR_ERR_MASK).Please note: The register CRC errors as well as the internal IC errors donot have an error counter.
    #define NR_ERR__ERR_0					 0b0000000000000000	// 0 
    #define NR_ERR__ERR_1					 0b0000000000000001	// 1 
    #define NR_ERR__ERR_2					 0b0000000000000010	// 2 (default) 
    #define NR_ERR__ERR_3					 0b0000000000000011	// 3 
    #define NR_ERR__ERR_4					 0b0000000000000100	// 4 
    #define NR_ERR__ERR_5					 0b0000000000000101	// 5 
    #define NR_ERR__ERR_6					 0b0000000000000110	// 6 
    #define NR_ERR__ERR_7					 0b0000000000000111	// 7 
extern const subreg_item  RR_ERR_CNT__NR_EXT_TEMP_START; 			// RW - External temperature triggering in round robin
    #define NR_EXT_TEMP_START__EVERY_RR		 0b0000000000000000	 // Every RR (default)
    #define NR_EXT_TEMP_START__1RR_1RR_NO_MES 0b0000000000001000 // 1 RR measurement, 1 RR no measurement
    #define NR_EXT_TEMP_START__1RR_2RR_NO_MES 0b0000000000010000 // 1 RR measurement, 2 RR no measurement
    #define NR_EXT_TEMP_START__1RR_3RR_NO_MES 0b0000000000011000 // 1 RR measurement, 3 RR no measurement
    #define NR_EXT_TEMP_START__1RR_4RR_NO_MES 0b0000000000100000 // 1 RR measurement, 4 RR no measurement
    #define NR_EXT_TEMP_START__1RR_5RR_NO_MES 0b0000000000101000 // 1 RR measurement, 5 RR no measurement
    #define NR_EXT_TEMP_START__1RR_6RR_NO_MES 0b0000000000110000 // 1 RR measurement, 6 RR no measurement
    #define NR_EXT_TEMP_START__1RR_7RR_NO_MES 0b0000000000111000 // 1 RR measurement, 7 RR no measurement
extern const subreg_item  RR_ERR_CNT__RR_SLEEP_CNT; 				// RW - Round robin timing in sleep mode
    #define RR_SLEEP_CNT__DEACT				 0b0000000000000000	// RR in sleep mode is deactivated (default). 
    #define RR_SLEEP_CNT__RR_SLEEP_1		 0b0000000001000000	// tRR_sleep_LSB 
    #define RR_SLEEP_CNT__RR_SLEEP_1023		 0b1111111111000000	// tRR_sleep_LSB*1023 

// RR_CONFIG - 0009H Round robin configuration [supplied in sleep)
extern const subreg_item  RR_CONFIG__RR_CNT; 						// RW - Round robin counter
    #define RR_CNT__RR_0					 0b0000000000000000	// Round robin starts every tRR_min. 
    #define RR_CNT__RR_36					 0b0000000000100100	// Round robin starts every tRR_min + 36 * tRR_LSB (default).
    #define RR_CNT__RR_127					 0b0000000001111111	// Round robin starts every tRR_max. 
extern const subreg_item  RR_CONFIG__RR_SYNC; 						// RW - Round robin synchronization
    #define RR_SYNC__NO_SYNC				 0b0000000000000000	// No synch with WD_CNT write access (default). 
    #define RR_SYNC__SYNC					 0b0000000010000000	// Synch with WD_CNT write access (RR will be started by write access, if RR is already running the RR will be restarted from beginning again).
extern const subreg_item  RR_CONFIG__M_NR_ERR_ADC_ERR; 				// RW - Mask NR_ERR counter for ADC error
    #define M_NR_ERR_ADC_ERR__DISABLE		 0b0000000000000000	// No masking of NR_ERR. Counter is active (default). 
    #define M_NR_ERR_ADC_ERR__ENABLE		 0b0000000100000000	// NR_ERR counter masked. Fault valid after first detection. 
extern const subreg_item  RR_CONFIG__M_NR_ERR_OL_ERR; 				// RW - Mask NR_ERR counter for open load error
    #define M_NR_ERR_OL_ERR__DISABLE		 0b0000000000000000	// No masking of NR_ERR. Counter is active (default). 
    #define M_NR_ERR_OL_ERR__ENABLE			 0b0000001000000000	// NR_ERR counter masked. Fault valid after first detection. 
extern const subreg_item  RR_CONFIG__M_NR_ERR_EXT_T_ERR; 			// RW - Mask NR_ERR counter for external temperature error
    #define M_NR_ERR_EXT_T_ERR__DISABLE		 0b0000000000000000	// No masking of NR_ERR. Counter is active (default). 
    #define M_NR_ERR_EXT_T_ERR__ENABLE		 0b0000010000000000	// NR_ERR counter masked. Fault valid after first detection. 
extern const subreg_item  RR_CONFIG__M_NR_ERR_INT_OT; 				// RW - Mask NR_ERR counter for internal temperature error
    #define M_NR_ERR_INT_OT__DISABLE		 0b0000000000000000	// No masking of NR_ERR. Counter is active (default). 
    #define M_NR_ERR_INT_OT__ENABLE			 0b0000100000000000	// NR_ERR counter masked. Fault valid after first detection. 
extern const subreg_item  RR_CONFIG__M_NR_ERR_CELL_UV; 				// RW - Mask NR_ERR counter for undervoltage error
    #define M_NR_ERR_CELL_UV__DISABLE		 0b0000000000000000	// No masking of NR_ERR. Counter is active (default). 
    #define M_NR_ERR_CELL_UV__ENABLE		 0b0001000000000000	// NR_ERR counter masked. Fault valid after first detection. 
extern const subreg_item  RR_CONFIG__M_NR_ERR_CELL_OV; 				// RW - Mask NR_ERR counter for overvoltage error
    #define M_NR_ERR_CELL_OV__DISABLE		 0b0000000000000000	// No masking of NR_ERR. Counter is active (default). 
    #define M_NR_ERR_CELL_OV__ENABLE		 0b0010000000000000	// NR_ERR counter masked. Fault valid after first detection. 
extern const subreg_item  RR_CONFIG__M_NR_ERR_BAL_UC; 				// RW - Mmask NR_ERR counter for balancing error undercurrent
    #define M_NR_ERR_BAL_UC__DISABLE		 0b0000000000000000	// No masking of NR_ERR. Counter is active (default). 
    #define M_NR_ERR_BAL_UC__ENABLE			 0b0100000000000000	// NR_ERR counter masked. Fault valid after first detection. 
extern const subreg_item  RR_CONFIG__M_NR_ERR_BAL_OC; 				// RW - Mask NR_ERR counter for balancing error overcurrent
    #define M_NR_ERR_BAL_OC__DISABLE		 0b0000000000000000	// No masking of NR_ERR. Counter is active. 
    #define M_NR_ERR_BAL_OC__ENABLE			 0b1000000000000000	// NR_ERR counter masked. Fault valid after first detection (default).

