Infineon/IMR_PSoC6_BMS/proj_cm4/BMS_TLE9012/tle9012_registers.h
// FAULT_MASK - 000AH ERR pin / EMM mask [supplied in sleep)
extern const subreg_item  FAULT_MASK__ERR_PIN; 						// RW - Enable Error PIN functionality
    #define ERR_PIN__DISABLE				 0b0000000000000000	// ERR pin deactivated, EMM signal active. Device goes back to the mode as it was before the EMM (default).
    #define ERR_PIN__ENABLE					 0b0000000000100000	// ERR Pin function enabled. Fault indication only via ERR Pin. EMM signal deactivated. If ERR PIN triggered, pin stays high(device is then in normal mode) until watchdog runs out or pin iscleared.
extern const subreg_item  FAULT_MASK__M_ADC_ERR; 					// RW - EMM/ERR mask for ADC error
    #define M_ADC_ERR__DISABLE				 0b0000000000000000	// ERR/EMM will NOT be set if this type of error occurs (default).
    #define M_ADC_ERR__ENABLE				 0b0000000001000000	// ERR/EMM will be set for this type of error. 
extern const subreg_item  FAULT_MASK__M_OL_ERR; 					// RW - EMM/ERR mask for open load error
    #define M_OL_ERR__DISABLE				 0b0000000000000000	// ERR/EMM will NOT be set if this type of error occurs (default).
    #define M_OL_ERR__ENABLE				 0b0000000010000000	// ERR/EMM will be set for this type of error. 
extern const subreg_item  FAULT_MASK__M_INT_IC_ERR; 				// RW - EMM/ERR mask for internal IC error
    #define M_INT_IC_ERR__DISABLE			 0b0000000000000000	// ERR/EMM will NOT be set if this type of error occurs (default).
    #define M_INT_IC_ERR__ENABLE			 0b0000000100000000	// ERR/EMM will be set for this type of error. 
extern const subreg_item  FAULT_MASK__M_REG_CRC_ERR; 				// RW - EMM/ERR mask for register CRC error
    #define M_REG_CRC_ERR__DISABLE			 0b0000000000000000	// ERR/EMM will NOT be set if this type of error occurs (default).
    #define M_REG_CRC_ERR__ENABLE			 0b0000001000000000	// ERR/EMM will be set for this type of error. 
extern const subreg_item  FAULT_MASK__M_EXT_T_ERR; 					// RW - EMM/ERR mask for external temperature error
    #define M_EXT_T_ERR__DISABLE			 0b0000000000000000	// ERR/EMM will NOT be set if this type of error occurs (default).
    #define M_EXT_T_ERR__ENABLE				 0b0000010000000000	// ERR/EMM will be set for this type of error. 
extern const subreg_item  FAULT_MASK__M_INT_OT; 					// RW - EMM/ERR mask for internal temperature error
    #define M_INT_OT__DISABLE				 0b0000000000000000	// ERR/EMM will NOT be set if this type of error occurs (default).
    #define M_INT_OT__ENABLE				 0b0000100000000000	// ERR/EMM will be set for this type of error. 
extern const subreg_item  FAULT_MASK__M_CELL_UV; 					// RW - EMM/ERR mask for cell undervoltage error
    #define M_CELL_UV__DISABLE				 0b0000000000000000	// ERR/EMM will NOT be set if this type of error occurs (default).
    #define M_CELL_UV__ENABLE				 0b0001000000000000	// ERR/EMM will be set for this type of error. 
extern const subreg_item  FAULT_MASK__M_CELL_OV; 					// RW - EMM/ERR mask for cell overvoltage error
    #define M_CELL_OV__DISABLE				 0b0000000000000000	// ERR/EMM will NOT be set if this type of error occurs (default).
    #define M_CELL_OV__ENABLE				 0b0010000000000000	// ERR/EMM will be set for this type of error. 
extern const subreg_item  FAULT_MASK__M_BAL_ERR_UC; 				// RW - EMM/ERR mask for balancing error undercurrent
    #define M_BAL_ERR_UC__DISABLE			 0b0000000000000000	// ERR/EMM will NOT be set if this type of error occurs (default).
    #define M_BAL_ERR_UC__ENABLE			 0b0100000000000000	// ERR/EMM will be set for this type of error. 
extern const subreg_item  FAULT_MASK__M_BAL_ERR_OC; 				// RW - EMM/ERR mask for balancing error overcurrent
    #define M_BAL_ERR_OC__DISABLE			 0b0000000000000000	// ERR/EMM will NOT be set if this type of error occurs (default).
    #define M_BAL_ERR_OC__ENABLE			 0b1000000000000000	// ERR/EMM will be set for this type of error. 

// GEN_DIAG - 000BH General diagnostics [supplied in sleep)
extern const subreg_item  GEN_DIAG__UART_WAKEUP; 					// RH - Wake-up via UART
    #define UART_WAKEUP__ISOUART			 0b0000000000000000	// Wake-up via iso UART (default) 
    #define UART_WAKEUP__UART				 0b0000000000000001	// Wake-up via UART (GPIO) 
extern const subreg_item  GEN_DIAG__MOT_MOB_N; 						// RH - Primary on Top/Bottom configuration
    #define MOT_MOB_N__BOTTOM				 0b0000000000000000	// Configured as primary on bottom (default) 
    #define MOT_MOB_N__TOP					 0b0000000000000010	// Configured as primary on top 
extern const subreg_item  GEN_DIAG__BAL_ACTIVE; 					// RH - Balancing active
    #define BAL_ACTIVE__OFF					 0b0000000000000000	// No balancing ongoing (default) 
    #define BAL_ACTIVE__ON					 0b0000000000000100	// Balancing ongoing, at least one channel is on 
extern const subreg_item  GEN_DIAG__LOCK_MEAS; 						// RH - Lock measurement This bit indicates an ongoing PCVM, SCVM, BVM or AVM measurement ora delayed RR.
    #define LOCK_MEAS__MEAS_OFF				 0b0000000000000000	// No measurement ongoing (default) 
    #define LOCK_MEAS__MEAS_ON				 0b0000000000001000	// PCVM, SCVM, BVM or AVM measurement ongoing 
extern const subreg_item  GEN_DIAG__RR_ACTIVE; 						// RH - Round robin active This bit indicates if the round robin was active during read.
    #define RR_ACTIVE__OFF					 0b0000000000000000	// No round robin active (default) 
    #define RR_ACTIVE__ON					 0b0000000000010000	// Round robin active 
extern const subreg_item  GEN_DIAG__PS_ERR_SLEEP; 					// ROCW - Power supply error induced sleep
    #define PS_ERR_SLEEP__NO_ERR			 0b0000000000000000	// No power supply error induced sleep (default) 
    #define PS_ERR_SLEEP__ERR_OCCURED		 0b0000000000100000	// Power supply error induced sleep occured 
extern const subreg_item  GEN_DIAG__ADC_ERR; 						// ROCW - ADC Error
    #define ADC_ERR__NO_ERR					 0b0000000000000000	// No ADC mismatch between sum of PCVM and BVM (default)
    #define ADC_ERR__ERR_OCCURED			 0b0000000001000000	// ERROR of ADC-result comparison. Balancing deactivated.
extern const subreg_item  GEN_DIAG__OL_ERR; 						// ROCWL - Open load error Please note: Resetting the error here resets also the respective detailederror register.
    #define OL_ERR__NO_ERR					 0b0000000000000000	// No open load error (default) 
    #define OL_ERR__ERR_OCCURED				 0b0000000010000000	// Open load error occured. Detailed information in the respective error register. Balancing deactivated.
extern const subreg_item  GEN_DIAG__INT_IC_ERR; 					// ROCW - Internal IC error
    #define INT_IC_ERR__NO_ERR				 0b0000000000000000	// No internal error (default) 
    #define INT_IC_ERR__ERR_OCCURED			 0b0000000100000000	// Internal IC check error occurred. Balancing is deactivated.
extern const subreg_item  GEN_DIAG__REG_CRC_ERR; 					// ROCWL - Register CRC error Please note: Resetting the error here resets also the respective detailederror register.
    #define REG_CRC_ERR__NO_ERR				 0b0000000000000000	// No CRC check error (default) 
    #define REG_CRC_ERR__ERR_OCCURED		 0b0000001000000000	// CRC check error occured. Detailed information in the respective error register. Balancing deactivated.
extern const subreg_item  GEN_DIAG__EXT_T_ERR; 					// ROCWL - External temperature error Please note: Resetting the error here resets also the respective detailederror register.
    #define EXT_T_ERR__NO_ERR				 0b0000000000000000	// No external temperature error (default) 
    #define EXT_T_ERR__ERR_OCCURED			 0b0000010000000000	// External temperature error occured. Detailed information in the respective error register. Balancing isdeactivated.
extern const subreg_item  GEN_DIAG__INT_OT; 						// ROCW - Internal temperature (OT) error
    #define INT_OT__NO_ERR					 0b0000000000000000	// No internal OT error (default) 
    #define INT_OT__ERR_OCCURED				 0b0000100000000000	// Internal OT error occured. Balancing is deactivated.
extern const subreg_item  GEN_DIAG__CELL_UV; 						// ROCWL - Cell undervoltage (UV) error Please note: Resetting the error here resets also the respective detailederror register.
    #define CELL_UV__NO_ERR					 0b0000000000000000	// No UV error (default) 
    #define CELL_UV__ERR_OCCURED			 0b0001000000000000	// UV error occured. Detailed information in the respective error register.
extern const subreg_item  GEN_DIAG__CELL_OV; 						// ROCWL - Cell overvoltage (OV) error Please note: Resetting the error here resets also the respective detailederror register.
    #define CELL_OV__NO_ERR					 0b0000000000000000	// No OV error (default) 
    #define CELL_OV__ERR_OCCURED			 0b0010000000000000	// OV error occured. Detailed information in the respective error register.
extern const subreg_item  GEN_DIAG__BAL_ERR_UC; 					// ROCWL - Balancing error undercurrent (will be reset in sleep mode) Please note: Resetting the error here resets also the respective detailederror register.
    #define BAL_ERR_UC__NO_ERR				 0b0000000000000000	// No balancing error (default) 
    #define BAL_ERR_UC__ERR_OCCURED			 0b0100000000000000	// Balancing error occured. Detailed information in the respective error register.
extern const subreg_item  GEN_DIAG__BAL_ERR_OC; 					// ROCWL - Balancing error overcurrent (will be reset in sleep mode) Please Note: Resetting the error here resets also the respective detailederror register.
    #define BAL_ERR_OC__NO_ERR				 0b0000000000000000	// No balancing error (default) 
    #define BAL_ERR_OC__ERR_OCCURED			 0b1000000000000000	// Balancing error occured. Detailed information in the respective error register.

// CELL_UV - 000CH Cell voltage supervision warning flags UV [supplied in sleep)
extern const subreg_item  CELL_UV__UV_i; 							// ROCW - Undervoltage in cell i Can also be cleared on write '0' to connected GEN_DIAG register bit.
    #define UV_i__NO_UV						 0b0000000000000000	// No undervoltage detected in respective cell (default) 
    #define UV_i__UV						 0b0000100000000000	// Undervoltage detected in respective cell. Balancing is deactivated.

// CELL_OV - 000DH Cell voltage supervision warning flags OV [supplied in sleep)
extern const subreg_item  CELL_OV__OV_i; 							// ROCW - Overvoltage in cell i Can also be cleared on write '0' to connected GEN_DIAG register bit.
    #define OV_i__NO_OV						 0b0000000000000000	// No overvoltage detected in respective cell (default) 
    #define OV_i__OV						 0b0000100000000000	// Overvoltage detected in respective cell. Balancing is deactivated.

// EXT_TEMP_DIAG - 000EH External overtemperature warning flags [supplied in sleep)
extern const subreg_item  EXT_TEMP_DIAG__OPEN0; 					// ROCW - Open load in external temp 0 Can also be cleared on write '0' to connected GEN_DIAG register bit.
    #define OPEN0__NO_OL					 0b0000000000000000	// No open load in external temp 0 (default) 
    #define OPEN0__OL_OCCURED				 0b0000000000000001	// Open load in external temp 0 
extern const subreg_item  EXT_TEMP_DIAG__SHORT0; 					// ROCW - Short in external temp 0 Can also be cleared on write '0' to connected GEN_DIAG register bit.
    #define SHORT0__NO_SHORT				 0b0000000000000000	// No short in external temp 0 (default) 
    #define SHORT0__SHORT_OCCURED			 0b0000000000000010	// Short in external temp 0 
extern const subreg_item  EXT_TEMP_DIAG__OT0; 						// ROCW - Overtemperature in external temp 0 Can also be cleared on write '0' to connected GEN_DIAG register bit.
    #define OT0__NO_OT						 0b0000000000000000	// No overtemperature in external temp 0 (default) 
    #define OT0__OT_OCCURED					 0b0000000000000100	// ADC conversion of external temp 0 measurement < overtemperature threshold EXT_OT_THR
extern const subreg_item  EXT_TEMP_DIAG__OPEN1; 					// ROCW - Open load in external temp 1 Can also be cleared on write '0' to connected GEN_DIAG register bit.
    #define OPEN1__NO_OL					 0b0000000000000000	// No open load in external temp 1 (default) 
    #define OPEN1__OL_OCCURED				 0b0000000000001000	// Open load in external temp 1 
extern const subreg_item  EXT_TEMP_DIAG__SHORT1; 					// ROCW - Short in external temp 1 Can also be cleared on write '0' to connected GEN_DIAG register bit.
    #define SHORT1__NO_SHORT				 0b0000000000000000	// No short in external temp 1 (default) 
    #define SHORT1__SHORT_OCCURED			 0b0000000000010000	// Short in external temp 1 
extern const subreg_item  EXT_TEMP_DIAG__OT1; 						// ROCW - Overtemperature in external temp 1 Can also be cleared on write '0' to connected GEN_DIAG register bit.
    #define OT1__NO_OT						 0b0000000000000000	// No overtemperature in external temp 1 (default) 
    #define OT1__OT_OCCURED					 0b0000000000100000	// ADC conversion of external temp 1 measurement < overtemperature threshold EXT_OT_THR
extern const subreg_item  EXT_TEMP_DIAG__OPEN2; 					// ROCW - Open load in external temp 2 Can also be cleared on write '0' to connected GEN_DIAG register bit.
    #define OPEN2__NO_OL					 0b0000000000000000	// No open load in external temp 2 (default) 
    #define OPEN2__OL_OCCURED				 0b0000000001000000	// Open load in external temp 2 
extern const subreg_item  EXT_TEMP_DIAG__SHORT2; 					// ROCW - Short in external temp 2 Can also be cleared on write '0' to connected GEN_DIAG register bit.
    #define SHORT2__NO_SHORT				 0b0000000000000000	// No short in external temp 2 (default) 
    #define SHORT2__SHORT_OCCURED			 0b0000000010000000	// Short in external temp 2 
extern const subreg_item  EXT_TEMP_DIAG__OT2; 						// ROCW - Overtemperature in external temp 2 Can also be cleared on write '0' to connected GEN_DIAG register bit.
    #define OT2__NO_OT						 0b0000000000000000	// No overtemperature in external temp 2 (default) 
    #define OT2__OT_OCCURED					 0b0000000100000000	// ADC conversion of external temp 2 measurement < overtemperature threshold EXT_OT_THR
extern const subreg_item  EXT_TEMP_DIAG__OPEN3; 					// ROCW - Open load in external temp 3 Can also be cleared on write '0' to connected GEN_DIAG register bit.
    #define OPEN3__NO_OL					 0b0000000000000000	// No open load in external temp 3 (default) 
    #define OPEN3__OL_OCCURED				 0b0000001000000000	// Open load in external temp 3 
extern const subreg_item  EXT_TEMP_DIAG__SHORT3; 					// ROCW - Short in external temp 3 Can also be cleared on write '0' to connected GEN_DIAG register bit.
    #define SHORT3__NO_SHORT				 0b0000000000000000	// No short in external temp 3 (default) 
    #define SHORT3__SHORT_OCCURED			 0b0000010000000000	// Short in external temp 3 
extern const subreg_item  EXT_TEMP_DIAG__OT3; 						// ROCW - Overtemperature in external temp 3 Can also be cleared on write '0' to connected GEN_DIAG register bit.
    #define OT3__NO_OT						 0b0000000000000000	// No overtemperature in external temp 3 (default) 
    #define OT3__OT_OCCURED					 0b0000100000000000	// ADC conversion of external temp 3 measurement < overtemperature threshold EXT_OT_THR
extern const subreg_item  EXT_TEMP_DIAG__OPEN4; 					// ROCW - Open load in external temp 4 Can also be cleared on write '0' to connected GEN_DIAG register bit.
    #define OPEN4__NO_OL					 0b0000000000000000	// No open load in external temp 4 (default) 
    #define OPEN4__OL_OCCURED				 0b0001000000000000	// Open load in external temp 4 
extern const subreg_item  EXT_TEMP_DIAG__SHORT4; 					// ROCW - Short in external temp 4 Can also be cleared on write '0' to connected GEN_DIAG register bit.
    #define SHORT4__NO_SHORT				 0b0000000000000000	// No short in external temp 4 (default) 
    #define SHORT4__SHORT_OCCURED			 0b0010000000000000	// Short in external temp 4 
extern const subreg_item  EXT_TEMP_DIAG__OT4; 						// ROCW - Overtemperature in external temp 4 Can also be cleared on write '0' to connected GEN_DIAG register bit.
    #define OT4__NO_OT						 0b0000000000000000	// No overtemperature in external temp 4 (default) 
    #define OT4__OT_OCCURED					 0b0100000000000000	// ADC conversion of external temp 4 measurement < overtemperature threshold EXT_OT_THR

// DIAG_OL - 0010H Diagnostics open load [supplied in sleep)
extern const subreg_item  DIAG_OL__OL_i; 							// ROCW - Open load channel i Can also be cleared on write '0' to connected GEN_DIAG register bit.
    #define OL_i__NO_OL						 0b0000000000000000	// No open load detected for respective channel (default) 
    #define OL_i__OL						 0b0000100000000000	// Open load detected for respective channel 

// REG_CRC_ERR - 0011H REG_CRC_ERR [supplied in sleep)
extern const subreg_item  REG_CRC_ERR__ADDR; 						// ROCW - Register address of register where CRC check failed Register address of CRC check fail, can also be cleared on write '0' toconnected GEN_DIAG register bit.
    #define ADDR__DEFAULT					 0b0000000000000000	// Register address 

// CELL_UV_DAC_COMP - 0012H Cell voltage supervision warning flags UV [supplied in sleep)
extern const subreg_item  CELL_UV_DAC_COMP__UV_i; 					// ROCW - Undervoltage in cell i Can also be cleared on write '0' to connected GEN_DIAG register bit.
    #define UV_i__NO_UV						 0b0000000000000000	// No undervoltage detected in respective cell (default) 
    #define UV_i__UV						 0b0000100000000000	// Uundervoltage detected in respective cell 

// CELL_OV_DAC_COMP - 0013H Cell voltage supervision warning flags OV [supplied in sleep)
extern const subreg_item  CELL_OV_DAC_COMP__OV_i; 					// ROCW - Overvoltage in cell i Can also be cleared on write '0' to connected GEN_DIAG register bit.
    #define OV_i__NO_OV						 0b0000000000000000	// No overvoltage detected in respective cell (default) 
    #define OV_i__OV						 0b0000100000000000	// Overvoltage detected in respective cell 

