Infineon/IMR_PSoC6_BMS/proj_cm4/BMS_TLE9012/tle9012_registers.h
// OP_MODE - 0014H Operation mode
extern const subreg_item  OP_MODE__PD; 								// RW - Activate sleep mode
    #define PD__NORMAL_OP					 0b0000000000000000	// Chip operating in normal mode (default) 
    #define PD__PWD_OP						 0b0000000000000001	// Chip is set to sleep mode. No further communication possible after bit is set to '1'.
extern const subreg_item  OP_MODE__EXT_WD; 							// RW - Extended watchdog
    #define EXT_WD__NOT_ACTIVE				 0b0000000000000000	// No extended watchdog (default) 
    #define EXT_WD__ACTIVE					 0b0000000000000010	// Extended watchdog active 
extern const subreg_item  OP_MODE__SLEEP_REG_RESET; 				// RWH - Sleep mode registers reset
    #define SLEEP_REG_RESET__NORMAL_OP		 0b0000000000000000	// Chip operating in normal mode (default) 
    #define SLEEP_REG_RESET__SLEEP_REG_RESET_OP 0b0000000000000100	// Resets all registers that are supplied in sleep mode. No further communication possible after bit is set to '1'.
extern const subreg_item  OP_MODE__I_DIAG_EN; 						// RW - Force OL diagnostics currents
    #define I_DIAG_EN__OFF					 0b0000000000000000	// Diagnostics currents switched via round robin (default) 
    #define I_DIAG_EN__ON					 0b0000000000001000	// Diagnostics currents enabled for all channels 
extern const subreg_item  OP_MODE__LR_TIME; 						// RW - Long-running mode measurement restart time
    #define LR_TIME__MIN					 0b0000000000000000	// Minimum (1.17ms) 
    #define LR_TIME__DEFAULT				 0b1100010000000000	// 6.25 ms 

// BAL_CURR_THR - 0015H Balancing current thresholds
extern const subreg_item  BAL_CURR_THR__OC_THR; 					// RW - Overcurrent fault threshold 8-bit to define the maximum voltage drop during balancing diagnostics. If the voltage drop (I Bal*R F) > OC_THR the overcurrentis detected.
    #define OC_THR__DEFAULT					 0b0000000010101100	// Default 
extern const subreg_item  BAL_CURR_THR__UC_THR; 					// RW - Undercurrent fault threshold 8-bit to define the minimum voltage drop during balancing diagnostics.If the voltage drop (I Bal*R F) < UC_THR the undercurrent is detected.
    #define UC_THR__DEFAULT					 0b0000000000000000	// Default 

// BAL_SETTINGS - 0016H Balance settingsONi (i=0-11) i rwh Switching state of balancing switch i
    #define BAL_SETTINGS__OFF				 0b0000000000000000	// Respective balancing switch off (default)

// AVM_CONFIG - 0017H Auxiliary voltage measurement configuration
extern const subreg_item  AVM_CONFIG__TEMP_MUX_DIAG_SEL; 			// RW - Selector for external temp diagnose
    #define TEMP_MUX_DIAG_SEL__PD_EXT_TEMP_0 0b0000000000000000	// Pulldown for external temp 0 measurement is active.
    #define TEMP_MUX_DIAG_SEL__PD_EXT_TEMP_1 0b0000000000000001	// Pulldown for external temp 1 measurement is active.
    #define TEMP_MUX_DIAG_SEL__PD_EXT_TEMP_2 0b0000000000000010	// Pulldown for external temp 2 measurement is active.
    #define TEMP_MUX_DIAG_SEL__PD_EXT_TEMP_3 0b0000000000000011	// Pulldown for external temp 3 measurement is active.
    #define TEMP_MUX_DIAG_SEL__PD_EXT_TEMP_4 0b0000000000000100	// Pulldown for external temp 4 measurement is active.
    #define TEMP_MUX_DIAG_SEL__NO_PD		 0b0000000000000111	// No pulldown is active (default), 
extern const subreg_item  AVM_CONFIG__AVM_TMP0_MASK; 				// RW - Activate auxiliary measurement via deactive TMP0 as part of AVM
    #define AVM_TMP0_MASK__MASKED			 0b0000000000000000	// Manual AVM TMP0 measurement masked out when AVM_START bit triggered (default).
    #define AVM_TMP0_MASK__PERFORMED		 0b0000000000001000	// Manual AVM TMP0 measurement performed when AVM_START bit triggered.
extern const subreg_item  AVM_CONFIG__AVM_TMP1_MASK; 				// RW - Activate auxiliary measurement via deactive TMP1 as part of AVM
    #define AVM_TMP1_MASK__MASKED			 0b0000000000000000	// Manual AVM TMP1 measurement masked out when AVM_START bit triggered (default).
    #define AVM_TMP1_MASK__PERFORMED		 0b0000000000010000	// Manual AVM TMP1 measurement performed when AVM_START bit triggered.
extern const subreg_item  AVM_CONFIG__AVM_TMP2_MASK; 				// RW - Activate auxiliary measurement via deactive TMP2 as part of AVM
    #define AVM_TMP2_MASK__MASKED			 0b0000000000000000	// Manual AVM TMP2 measurement masked out when AVM_START bit triggered (default).
    #define AVM_TMP2_MASK__PERFORMED		 0b0000000000100000	// Manual AVM TMP2 measurement performed when AVM_START bit triggered.
extern const subreg_item  AVM_CONFIG__AVM_TMP3_MASK; 				// RW - Activate auxiliary measurement via deactive TMP3 as part of AVM
    #define AVM_TMP3_MASK__MASKED			 0b0000000000000000	// Manual AVM TMP3 measurement masked out when AVM_START bit triggered (default).
    #define AVM_TMP3_MASK__PERFORMED		 0b0000000001000000	// Manual AVM TMP3 measurement performed when AVM_START bit triggered.
extern const subreg_item  AVM_CONFIG__AVM_TMP4_MASK; 				// RW - Activate auxiliary measurement via deactive TMP4 as part of AVM
    #define AVM_TMP4_MASK__MASKED			 0b0000000000000000	// Manual AVM TMP4 measurement masked out when AVM_START bit triggered (default).
    #define AVM_TMP4_MASK__PERFORMED		 0b0000000010000000	// Manual AVM TMP4 measurement performed when AVM_START bit triggered.
extern const subreg_item  AVM_CONFIG__AUX_BIPOLAR; 				// RWH - Bipolar AUX measurement instead of BVM
    #define AUX_BIPOLAR__BVM				 0b0000000000000000	// Normal BVM measurement 
    #define AUX_BIPOLAR__AUX				 0b0000000100000000	// Bipolar AUX measurement instead of BVM (Bit is reset when NR_TEMP_SENSE > 3, this can cause a REG_CRC_ERR).
extern const subreg_item  AVM_CONFIG__R_DIAG; 						// RW - Masking diagnostics resistor as part of AVM
    #define R_DIAG__MASKED					 0b0000000000000000	// Manual AVM diagnostics resistor measurement masked out when AVM_START bit triggered (default)
    #define R_DIAG__PERFORMED				 0b0000001000000000	// Manual AVM diagnostics resistor measurement performed when AVM_START bit triggered
extern const subreg_item  AVM_CONFIG__R_DIAG_SEL_0; 				// RW - R_DIAG current source 0
    #define R_DIAG_SEL_0__I_0				 0b0000000000000000	// Source ITMP0_0: 320uA (default) 
    #define R_DIAG_SEL_0__I_1				 0b0000100000000000	// Source ITMP0_1: 80uA 
    #define R_DIAG_SEL_0__I_2				 0b0001000000000000	// Source ITMP0_2: 20uA 
    #define R_DIAG_SEL_0__I_3				 0b0001100000000000	// Source ITMP0_3: 5uA 
extern const subreg_item  AVM_CONFIG__R_DIAG_SEL_1; 				// RW - R_DIAG current source 1
    #define R_DIAG_SEL_1__I_0				 0b0000000000000000	// Source ITMP1_0: 320uA (default) 
    #define R_DIAG_SEL_1__I_1				 0b0010000000000000	// Source ITMP1_1: 80uA 
    #define R_DIAG_SEL_1__I_2				 0b0100000000000000	// Source ITMP1_2: 20uA 
    #define R_DIAG_SEL_1__I_3				 0b0110000000000000	// Source ITMP1_3: 5uA 
extern const subreg_item  AVM_CONFIG__R_DIAG_CUR_SRC; 				// RW - R_DIAG current source selection
    #define R_DIAG_CUR_SRC__SRC_0			 0b0000000000000000	// Current source 0 (default) 
    #define R_DIAG_CUR_SRC__SRC_1			 0b1000000000000000	// Current source 1 

