Infineon/IMR_PSoC6_BMS/proj_cm4/BMS_TLE9012/tle9012_registers.h
// MEAS_CTRL - 0018H Measurement control
extern const subreg_item  MEAS_CTRL__CVM_DEL; 						// RW - Wait time before CVM and/or BVM is started when PBOFF=1
    #define CVM_DEL__NO_SETTLING_TIME		 0b0000000000000000	// No settling time 
    #define CVM_DEL__1						 0b0000000000000001	// tVM_del_LSB (default) 
    #define CVM_DEL__31						 0b0000000000011111	// 31 x tVM_del_LSB 
extern const subreg_item  MEAS_CTRL__PBOFF; 						// RW - Enable PBOFF
    #define PBOFF__BAL_CONTINUE				 0b0000000000000000	// Keep balancing state for PCVM/SCVM/BVM, no CVM_DEL. 
    #define PBOFF__BAL_INTERRUPT			 0b0000000000100000	// Switch off balancing before conversion starts (default).
extern const subreg_item  MEAS_CTRL__SCVM_START; 					// RWH - Start secondary cell voltage measurement Bit cleared if conversion done
    #define SCVM_START__NO_MEAS				 0b0000000000000000	// No measurement ongoing (default) 
    #define SCVM_START__TRIG_MEAS			 0b0000000001000000	// Trigger measurement 
extern const subreg_item  MEAS_CTRL__AVM_START; 					// RWH - Start auxiliary voltage measurement Bit cleared if conversion done
    #define AVM_START__NO_MEAS				 0b0000000000000000	// No measurement ongoing (default) 
    #define AVM_START__TRIG_MEAS			 0b0000000010000000	// Trigger measurement if BVM_START=0 
extern const subreg_item  MEAS_CTRL__BVM_MODE; 						// RW - Block voltage measurement mode
    #define BVM_MODE__10_BIT				 0b0000000000000000	// 10 bit (default) 
    #define BVM_MODE__11_BIT				 0b0000000100000000	// 11 bit 
    #define BVM_MODE__16_BIT				 0b0000011000000000	// 16 bit 
    #define BVM_MODE__LONG					 0b0000011100000000	// Long-running mode 
extern const subreg_item  MEAS_CTRL__BVM_START; 					// RWH - Start block voltage measurement Bit cleared if conversion done
    #define BVM_START__NO_MEAS				 0b0000000000000000	// No measurement ongoing (default) 
    #define BVM_START__TRIG_MEAS			 0b0000100000000000	// Trigger measurement 
extern const subreg_item  MEAS_CTRL__CVM_MODE; 						// RW - Cell voltage measurement mode
    #define CVM_MODE__10_BIT				 0b0000000000000000	// 10 bit (default) 
    #define CVM_MODE__11_BIT				 0b0001000000000000	// 11 bit 
    #define CVM_MODE__16_BIT				 0b0110000000000000	// 16 bit 
    #define CVM_MODE__LONG					 0b0111000000000000	// Long-running mode 
extern const subreg_item  MEAS_CTRL__PCVM_START; 					// RWH - Start primary cell voltage measurement Bit cleared if conversion done
    #define PCVM_START__NO_MEAS				 0b0000000000000000	// No measurement ongoing (default) 
    #define PCVM_START__TRIG_MEAS			 0b1000000000000000	// Trigger measurement 

// PCVM_0 - 0019H Primary cell voltage measurement i
extern const subreg_item  PCVM_0__RESULT; 							// RH - Result of cell voltage measurement
    #define RESULT__DEFAULT					 0b0000000000000000	// Default 

// PCVM_1 - 0020H Primary cell voltage measurement i
extern const subreg_item  PCVM_1__RESULT; 							// RH - Result of cell voltage measurement
    #define RESULT__DEFAULT					 0b0000000000000000	// Default 

// PCVM_2 - 0021H Primary cell voltage measurement i
extern const subreg_item  PCVM_2__RESULT; 							// RH - Result of cell voltage measurement
    #define RESULT__DEFAULT					 0b0000000000000000	// Default 

// PCVM_3 - 0022H Primary cell voltage measurement i
extern const subreg_item  PCVM_3__RESULT; 							// RH - Result of cell voltage measurement
    #define RESULT__DEFAULT					 0b0000000000000000	// Default 

// PCVM_4 - 0023H Primary cell voltage measurement i
extern const subreg_item  PCVM_4__RESULT; 							// RH - Result of cell voltage measurement
    #define RESULT__DEFAULT					 0b0000000000000000	// Default 

// PCVM_5 - 0024H Primary cell voltage measurement i
extern const subreg_item  PCVM_5__RESULT; 							// RH - Result of cell voltage measurement
    #define RESULT__DEFAULT					 0b0000000000000000	// Default 

// PCVM_6 - 0025H Primary cell voltage measurement i
extern const subreg_item  PCVM_6__RESULT; 							// RH - Result of cell voltage measurement
    #define RESULT__DEFAULT					 0b0000000000000000	// Default 

// PCVM_7 - 0026H Primary cell voltage measurement i
extern const subreg_item  PCVM_7__RESULT; 							// RH - Result of cell voltage measurement
    #define RESULT__DEFAULT					 0b0000000000000000	// Default 

// PCVM_8 - 0027H Primary cell voltage measurement i
extern const subreg_item  PCVM_8__RESULT; 							// RH - Result of cell voltage measurement
    #define RESULT__DEFAULT					 0b0000000000000000	// Default 

// PCVM_9 - 0028H Primary cell voltage measurement i
extern const subreg_item  PCVM_9__RESULT; 							// RH - Result of cell voltage measurement
    #define RESULT__DEFAULT					 0b0000000000000000	// Default 

// PCVM_10 - 0029H Primary cell voltage measurement i
extern const subreg_item  PCVM_10__RESULT; 							// RH - Result of cell voltage measurement
    #define RESULT__DEFAULT					 0b0000000000000000	// Default 

// PCVM_11 - 0030H Primary cell voltage measurement i
extern const subreg_item  PCVM_11__RESULT; 							// RH - Result of cell voltage measurement
    #define RESULT__DEFAULT					 0b0000000000000000	// Default 

// SCVM_HIGH - 0025H SCVM highest cell voltage
extern const subreg_item  SCVM_HIGH__UPD_CNT; 						// RH - Update counter
extern const subreg_item  SCVM_HIGH__RESULT; 						// RH - Result of SCVM measurement (highest cell voltage)

// SCVM_LOW - 0026H SCVM lowest cell voltage
extern const subreg_item  SCVM_LOW__UPD_CNT; 						// RH - Update counter
extern const subreg_item  SCVM_LOW__RESULT; 						// RH - Result of SCVM measurement (lowest cell voltage)

// STRESS_PCVM - 0027H Stress correction PCVM
extern const subreg_item  STRESS_PCVM__STRESS_CORRECTION; 			// RH - Stress correction value PCVM
    #define STRESS_CORRECTION__DEFAULT		 0b0000000000000000	// Default 

// BVM - 0028H Block voltage measurement
extern const subreg_item  BVM__RESULT; 								// RH - Result of block voltage measurement
    #define RESULT__DEFAULT					 0b0000000000000000	// Default 

// EXT_TEMP_0 - 0029H Temp result 0
extern const subreg_item  EXT_TEMP_0__RESULT; 						// RH - Result of external temp measurement SD-ADC result of resistance or voltage measurement.
    #define RESULT__DEFAULT					 0b0000000000000000	// Default 
extern const subreg_item  EXT_TEMP_0__INTC; 						// RH - Indicates which current source was used Number of current source that was active for latest measurement.
    #define INTC__I_0						 0b0000000000000000	// Source ITMPz_0 used (default) 
    #define INTC__I_1						 0b0000010000000000	// Source ITMPz_1 used 
    #define INTC__I_2						 0b0000100000000000	// Source ITMPz_2 used 
    #define INTC__I_3						 0b0000110000000000	// Source ITMPz_3 used 
extern const subreg_item  EXT_TEMP_0__PULLDOWN; 					// RH - Indicating pull-down switch state
    #define PULLDOWN__NORMAL_MEAS			 0b0000000000000000	// Normal measurement done (default) 
    #define PULLDOWN__PULL_DOWN				 0b0001000000000000	// Pull-down for Mux-test was active during conversion.
extern const subreg_item  EXT_TEMP_0__VALID; 						// ROCR - Indicating a valid result
    #define VALID__NO_NEW_RESULT			 0b0000000000000000	// No new result available (default) 
    #define VALID__NEW_RESULT_STORED		 0b0010000000000000	// A new result is stored in the register, cleared automatically after readout of the result register.
extern const subreg_item  EXT_TEMP_0__PD_ERR; 						// ROCW - Pull-down error Can also be cleared on write '0' to GEN_DIAG.EXT_T_ERR register bit.
    #define PD_ERR__NO_ERR					 0b0000000000000000	// No pulldown error 
    #define PD_ERR__ERR						 0b0100000000000000	// Pulldown error 

// EXT_TEMP_1 - 002AH Temp result 1
extern const subreg_item  EXT_TEMP_1__RESULT; 						// RH - Result of external temp measurement SD-ADC result of resistance or voltage measurement.
    #define RESULT__DEFAULT					 0b0000000000000000	// Default 
extern const subreg_item  EXT_TEMP_1__INTC; 						// RH - Indicates which current source was used Number of current source that was active for latest measurement.
    #define INTC__I_0						 0b0000000000000000	// Source ITMPz_0 used (default) 
    #define INTC__I_1						 0b0000010000000000	// Source ITMPz_1 used 
    #define INTC__I_2						 0b0000100000000000	// Source ITMPz_2 used 
    #define INTC__I_3						 0b0000110000000000	// Source ITMPz_3 used 
extern const subreg_item  EXT_TEMP_1__PULLDOWN; 					// RH - Indicating pull-down switch state
    #define PULLDOWN__NORMAL_MEAS			 0b0000000000000000	// Normal measurement done (default) 
    #define PULLDOWN__PULL_DOWN				 0b0001000000000000	// Pull-down for Mux-test was active during conversion.
extern const subreg_item  EXT_TEMP_1__VALID; 						// ROCR - Indicating a valid result
    #define VALID__NO_NEW_RESULT			 0b0000000000000000	// No new result available (default) 
    #define VALID__NEW_RESULT_STORED		 0b0010000000000000	// A new result is stored in the register, cleared automatically after readout of the result register.
extern const subreg_item  EXT_TEMP_1__PD_ERR; 						// ROCW - Pull-down error Can also be cleared on write '0' to GEN_DIAG.EXT_T_ERR register bit.
    #define PD_ERR__NO_ERR					 0b0000000000000000	// No pulldown error 
    #define PD_ERR__ERR						 0b0100000000000000	// Pulldown error 

