Infineon/IMR_PSoC6_BMS/proj_cm4/BMS_TLE9012/tle9012_registers.h
// EXT_TEMP_2 - 002BH Temp result 2
extern const subreg_item  EXT_TEMP_2__RESULT; 						// RH - Result of external temp measurement SD-ADC result of resistance or voltage measurement.
    #define RESULT__DEFAULT					 0b0000000000000000	// Default 
extern const subreg_item  EXT_TEMP_2__INTC; 						// RH - Indicates which current source was used Number of current source that was active for latest measurement.
    #define INTC__I_0						 0b0000000000000000	// Source ITMPz_0 used (default) 
    #define INTC__I_1						 0b0000010000000000	// Source ITMPz_1 used 
    #define INTC__I_2						 0b0000100000000000	// Source ITMPz_2 used 
    #define INTC__I_3						 0b0000110000000000	// Source ITMPz_3 used 
extern const subreg_item  EXT_TEMP_2__PULLDOWN; 					// RH - Indicating pull-down switch state
    #define PULLDOWN__NORMAL_MEAS			 0b0000000000000000	// Normal measurement done (default) 
    #define PULLDOWN__PULL_DOWN				 0b0001000000000000	// Pull-down for Mux-test was active during conversion.
extern const subreg_item  EXT_TEMP_2__VALID; 						// ROCR - Indicating a valid result
    #define VALID__NO_NEW_RESULT			 0b0000000000000000	// No new result available (default) 
    #define VALID__NEW_RESULT_STORED		 0b0010000000000000	// A new result is stored in the register, cleared automatically after readout of the result register.
extern const subreg_item  EXT_TEMP_2__PD_ERR; 						// ROCW - Pull-down error Can also be cleared on write '0' to GEN_DIAG.EXT_T_ERR register bit.
    #define PD_ERR__NO_ERR					 0b0000000000000000	// No pulldown error 
    #define PD_ERR__ERR						 0b0100000000000000	// Pulldown error 

// EXT_TEMP_3 - 002CH Temp result 3
extern const subreg_item  EXT_TEMP_3__RESULT; 						// RH - Result of external temp measurement SD-ADC result of resistance or voltage measurement.
    #define RESULT__DEFAULT					 0b0000000000000000	// Default 
extern const subreg_item  EXT_TEMP_3__INTC; 						// RH - Indicates which current source was used Number of current source that was active for latest measurement.
    #define INTC__I_0						 0b0000000000000000	// Source ITMPz_0 used (default) 
    #define INTC__I_1						 0b0000010000000000	// Source ITMPz_1 used 
    #define INTC__I_2						 0b0000100000000000	// Source ITMPz_2 used 
    #define INTC__I_3						 0b0000110000000000	// Source ITMPz_3 used 
extern const subreg_item  EXT_TEMP_3__PULLDOWN; 					// RH - Indicating pull-down switch state
    #define PULLDOWN__NORMAL_MEAS			 0b0000000000000000	// Normal measurement done (default) 
    #define PULLDOWN__PULL_DOWN				 0b0001000000000000	// Pull-down for Mux-test was active during conversion.
extern const subreg_item  EXT_TEMP_3__VALID; 						// ROCR - Indicating a valid result
    #define VALID__NO_NEW_RESULT			 0b0000000000000000	// No new result available (default) 
    #define VALID__NEW_RESULT_STORED		 0b0010000000000000	// A new result is stored in the register, cleared automatically after readout of the result register.
extern const subreg_item  EXT_TEMP_3__PD_ERR; 						// ROCW - Pull-down error Can also be cleared on write '0' to GEN_DIAG.EXT_T_ERR register bit.
    #define PD_ERR__NO_ERR					 0b0000000000000000	// No pulldown error 
    #define PD_ERR__ERR						 0b0100000000000000	// Pulldown error 

// EXT_TEMP_4 - 002DH Temp result 4
extern const subreg_item  EXT_TEMP_4__RESULT; 						// RH - Result of external temp measurement SD-ADC result of resistance or voltage measurement.
    #define RESULT__DEFAULT					 0b0000000000000000	// Default 
extern const subreg_item  EXT_TEMP_4__INTC; 						// RH - Indicates which current source was used Number of current source that was active for latest measurement.
    #define INTC__I_0						 0b0000000000000000	// Source ITMPz_0 used (default) 
    #define INTC__I_1						 0b0000010000000000	// Source ITMPz_1 used 
    #define INTC__I_2						 0b0000100000000000	// Source ITMPz_2 used 
    #define INTC__I_3						 0b0000110000000000	// Source ITMPz_3 used 
extern const subreg_item  EXT_TEMP_4__PULLDOWN; 					// RH - Indicating pull-down switch state
    #define PULLDOWN__NORMAL_MEAS			 0b0000000000000000	// Normal measurement done (default) 
    #define PULLDOWN__PULL_DOWN				 0b0001000000000000	// Pull-down for Mux-test was active during conversion.
extern const subreg_item  EXT_TEMP_4__VALID; 						// ROCR - Indicating a valid result
    #define VALID__NO_NEW_RESULT			 0b0000000000000000	// No new result available (default) 
    #define VALID__NEW_RESULT_STORED		 0b0010000000000000	// A new result is stored in the register, cleared automatically after readout of the result register2.
extern const subreg_item  EXT_TEMP_4__PD_ERR; 						// ROCW - Pull-down error Can also be cleared on write '0' to GEN_DIAG.EXT_T_ERR register bit.
    #define PD_ERR__NO_ERR					 0b0000000000000000	// No pulldown error 
    #define PD_ERR__ERR						 0b0100000000000000	// Pulldown error 

// EXT_TEMP_R_DIAG - 002FH Temp result R diagnose
extern const subreg_item  EXT_TEMP_R_DIAG__RESULT; 					// RH - Result of diagnostics resistor measurement SD-ADC result of diagnostics resistor measurement.
    #define RESULT__DEFAULT					 0b0000000000000000	// Default 
extern const subreg_item  EXT_TEMP_R_DIAG__INTC; 					// RH - Indicates which current source was used Number of current source that was active for latest measurement.
    #define INTC__I_0						 0b0000000000000000	// Source ITMPz_0 used (default) 
    #define INTC__I_1						 0b0000010000000000	// Source ITMPz_1 used 
    #define INTC__I_2						 0b0000100000000000	// Source ITMPz_2 used 
    #define INTC__I_3						 0b0000110000000000	// Source ITMPz_3 used 
extern const subreg_item  EXT_TEMP_R_DIAG__CUR_SRC; 				// RH - Indicates which current source was used
    #define CUR_SRC__SRC_0					 0b0000000000000000	// Source 0 (default) 
    #define CUR_SRC__SRC_1					 0b0001000000000000	// Source 1 
extern const subreg_item  EXT_TEMP_R_DIAG__VALID; 					// ROCR - Indicating a valid result
    #define VALID__NO_NEW_RESULT			 0b0000000000000000	// No new result available (default) 
    #define VALID__NEW_RESULT_STORED		 0b0010000000000000	// A new result is stored in the register, cleared automatically after readout of the result register.

// INT_TEMP - 0030H Chip temperature
extern const subreg_item  INT_TEMP__RESULT; 						// RH - Result of internal temperatur measurement SD-ADC result of internal temperature measurement.
    #define RESULT__DEFAULT					 0b0000000000000000	// Default 
extern const subreg_item  INT_TEMP__VALID; 							// ROCR - Indicating a valid result
    #define VALID__NO_NEW_RESULT			 0b0000000000000000	// No new result available (default) 
    #define VALID__NEW_RESULT_STORED		 0b0010000000000000	// A new result is stored in the register, cleared automatically after readout of the result register.

// MULTI_READ - 0031H Multiread command
extern const subreg_item  MULTI_READ__RES; 							// RH - Used in combination with MULTI_READ_CFG Reading this register by the host starts the multiple register readroutine which got define in the MULTI_READ_CFG register.
    #define RES__DEFAULT					 0b0000000000000000	// Not defined (default) 

// MULTI_READ_CFG - 0032H Multiread configuration (This register must be written with a broadcast write command)
extern const subreg_item  MULTI_READ_CFG__PCVM_SEL; 				// RW - Selects which PCVM results are part of the multiread No PCVM result for 1101B...1111B
    #define PCVM_SEL__NO_PCVM				 0b0000000000000000	// No PCVM result (default) 
    #define PCVM_SEL__RES_CELL_11			 0b0000000000000001	// Only result for cell 11 
    #define PCVM_SEL__RES_CELL_11_10		 0b0000000000000010	// Result of Cell 11-10 
    #define PCVM_SEL__RES_CELL_11_9			 0b0000000000000011	// Result of Cell 11-9 
    #define PCVM_SEL__RES_CELL_11_0			 0b0000000000001100	// Result of Cell 11-0 
extern const subreg_item  MULTI_READ_CFG__BVM_SEL; 					// RW - Selects if BVM result is part of multiread
    #define BVM_SEL__NO_RESULT				 0b0000000000000000	// No BVM result (default) 
    #define BVM_SEL__RESULT					 0b0000000000010000	// Result of BVM 
extern const subreg_item  MULTI_READ_CFG__EXT_TEMP_SEL; 			// RW - Selects which TEMP result is part of the multiread
    #define EXT_TEMP_SEL__NO_TEMP			 0b0000000000000000	// No TEMP result (default) 
    #define EXT_TEMP_SEL__RES_TMP0			 0b0000000000100000	// Result of TEMP_0 
    #define EXT_TEMP_SEL__RES_TMP0_1		 0b0000000001000000	// Result of TEMP_0 & TEMP_1 
    #define EXT_TEMP_SEL__RES_TMP0_2		 0b0000000001100000	// Result of TEMP_0 & TEMP_1 & TEMP_2 
    #define EXT_TEMP_SEL__RES_TMP0_3		 0b0000000010000000	// Result of TEMP_0 & TEMP_1 & TEMP_2 & TEMP_3 
    #define EXT_TEMP_SEL__RES_TMP0_4		 0b0000000010100000	// Result of TEMP_0 & TEMP_1 & TEMP_2 & TEMP_3 & TEMP_4 
extern const subreg_item  MULTI_READ_CFG__EXT_TEMP_R_SEL; 			// RW - Selects if R_DIAG result is part of the multiread
    #define EXT_TEMP_R_SEL__NO_R_DIAG_RES	 0b0000000000000000	// No R_DIAG result (default) 
    #define EXT_TEMP_R_SEL__R_DIAG_RES		 0b0000000100000000	// Result of R_DIAG
extern const subreg_item  MULTI_READ_CFG__INT_TEMP_SEL; 			// RW - 0B NO_INT_TMP_RES: No INT_TEMP result (default)
    #define INT_TEMP_SEL__NO_INT_TMP_RES	 0b0000000000000000	// Result of INT_TEMP
	#define INT_TEMP_SEL__INT_TMP_RES		 0b0000001000000000	// Result of INT_TEMP
extern const subreg_item  MULTI_READ_CFG__SCVM_SEL; 				// RW - Selects if SCVM results are part of the multiread
    #define SCVM_SEL__NO_RESULT				 0b0000000000000000	// No SCVM result (default) 
    #define SCVM_SEL__RESULT				 0b0000010000000000	// Result of SCVM_HIGH and SCVM_LOW 
extern const subreg_item  MULTI_READ_CFG__STRESS_PCVM_SEL; 			// RW - Selects if PCVM stress correction value is part of the multiread
    #define STRESS_PCVM_SEL__NO_RESULT		 0b0000000000000000	// No STRESS_PCVM result (default) 
    #define STRESS_PCVM_SEL__RESULT			 0b0000100000000000	// Result of STRESS_PCVM 

// BAL_DIAG_OC - 0033H Passive balancing diagnostics OVERCURRENT
extern const subreg_item  BAL_DIAG_OC__OC_i; 						// ROCW - Balancing overcurrent in cell i Can also be cleared on write '0' to connected GEN_DIAG register bit.
    #define OC_i__NO_OC						 0b0000000000000000	// No balancing overcurrent detected in respective cell (default) 
    #define OC_i__OC						 0b0000100000000000	// Balancing overcurrent detected in respective cell. Balancing is deactivated for this cell.

// BAL_DIAG_UC - 0034H Passive balancing diagnostics UNDERCURRENT
extern const subreg_item  BAL_DIAG_UC__UC_i; 						// ROCW - Balancing undercurrent in cell i Can also be cleared on write '0' to connected GEN_DIAG register bit.
    #define UC_i__NO_UC						 0b0000000000000000	// No balancing undercurrent detected in respective cell (default)
    #define UC_i__UC						 0b0000100000000000	// Balancing undercurrent detected in respective cell. Balancing is deactivated for this cell.

