Infineon/IMR_PSoC6_BMS/proj_cm4/BMS_TLE9012/tle9012_registers.h
// INT_TEMP_2 - 0035H Chip temperature 2
extern const subreg_item  INT_TEMP_2__RESULT; 						// RH - Result of internal temperatur 2 measurement SD-ADC result of internal temperature 2 measurement.
    #define RESULT__DEFAULT					 0b0000000000000000	// Default 
extern const subreg_item  INT_TEMP_2__VALID; 						// ROCR - Indicating a valid result
    #define VALID__NO_NEW_RESULT			 0b0000000000000000	// No new result available (default) 
    #define VALID__NEW_RESULT_STORED		 0b0010000000000000	// A new result is stored in the register, cleared automatically after readout of the result register.

// CONFIG_MAIN (CONFIG) - 0036H Configuration // Renamed to CONFIG_MAIN because CONFIG is to generic and used otherwise
extern const subreg_item  CONFIG__NODE_ID; 							// RWO - Address (ID) of the node, distributed during enumeration NODE_ID = 0 --> iso UART signals are not forwardedNODE_ID = 63 --> reserved for broadcast commands
extern const subreg_item  CONFIG__EN_ALL_ADC; 						// RW - Enable all ADCs If this bit is set, PCVM is done for each channel, independent ofPART_CONFIG setup.
    #define EN_ALL_ADC__SEL_ADC				 0b0000000000000000	// Only ADCs enabled which are defined in PART_CONFIG as active cell
    #define EN_ALL_ADC__ALL_ADC				 0b0000001000000000	// All ADCs enabled 
extern const subreg_item  CONFIG__FN; 								// RWO - Final Node The final node in stack must have this bit set. If final node does nothave FN set, no reply frame on broadcast will be sent.
    #define FN__NOT_FN						 0b0000000000000000	// Not the final node (default) 
    #define FN__FN							 0b0000100000000000	// Final node 

// GPIO - 0037H General purpose input / output
extern const subreg_item  GPIO__IN_GPIO0; 							// RH - GPIO 0 input state (ignored if communication over GPIO pins)
    #define IN_GPIO0__LOW					 0b0000000000000000	// Pin reads L (default) Also active for DIR_GPIO0 =1 (reading back driven value).
    #define IN_GPIO0__HIGH					 0b0000000000000001	// Pin reads H 
extern const subreg_item  GPIO__OUT_GPIO0; 							// RW - GPIO 0 output setting (ignored if communication over GPIO pins)
    #define OUT_GPIO0__LOW					 0b0000000000000000	// Drive L (default) 
    #define OUT_GPIO0__HIGH					 0b0000000000000010	// Drive H 
extern const subreg_item  GPIO__DIR_GPIO0; 							// RW - GPIO 0 direction (ignored if communication over GPIO pins)
    #define DIR_GPIO0__INPUT				 0b0000000000000000	// Input (output stage = HiZ) (default) 
    #define DIR_GPIO0__OUTPUT				 0b0000000000000100	// Output (output stage enabled) 
extern const subreg_item  GPIO__IN_GPIO1; 							// RH - GPIO 1 input state (ignored if communication over GPIO pins)
    #define IN_GPIO1__LOW					 0b0000000000000000	// Pin reads L (default) Also active for DIR_GPIO1 =1 (reading back driven value).
    #define IN_GPIO1__HIGH					 0b0000000000001000	// Pin reads H 
extern const subreg_item  GPIO__OUT_GPIO1; 							// RW - GPIO 1 output setting (ignored if communication over GPIO pins)
    #define OUT_GPIO1__LOW					 0b0000000000000000	// Drive L (default) 
    #define OUT_GPIO1__HIGH					 0b0000000000010000	// Drive H 
extern const subreg_item  GPIO__DIR_GPIO1; 							// RW - GPIO 1 direction (ignored if communication over GPIO pins)
    #define DIR_GPIO1__INPUT				 0b0000000000000000	// Input (output stage = HiZ) (default) 
    #define DIR_GPIO1__OUTPUT				 0b0000000000100000	// Output (output stage enabled) 
extern const subreg_item  GPIO__IN_PWM1; 							// RH - PWM 1 input state
    #define IN_PWM1__LOW					 0b0000000000000000	// Pin reads L (default) Also active for DIR_PWM1 =1 (reading back driven value).
    #define IN_PWM1__HIGH					 0b0000000001000000	// Pin reads H 
extern const subreg_item  GPIO__PWM_PWM1; 							// RW - PWM 1 enable PWM function
    #define PWM_PWM1__DISABLE				 0b0000000000000000	// No PWM function (default) 
    #define PWM_PWM1__ENABLE				 0b0000000010000000	// If DIR_PWM1 = 1, then PWM output regarding PWM_GPIO register and OUT_PWM1 is ignored. If DIR_PWM1 = 0, GPIO inputand no PWM function.
extern const subreg_item  GPIO__OUT_PWM1; 							// RW - PWM 1 output setting
    #define OUT_PWM1__LOW					 0b0000000000000000	// Drive L (default) 
    #define OUT_PWM1__HIGH					 0b0000000100000000	// Drive H 
extern const subreg_item  GPIO__DIR_PWM1; 							// RW - PWM 1 direction
    #define DIR_PWM1__INPUT					 0b0000000000000000	// Input (output stage = HiZ) (default) 
    #define DIR_PWM1__OUTPUT				 0b0000001000000000	// Output (output stage enabled) 
extern const subreg_item  GPIO__IN_PWM0; 							// RH - PWM 0 input state
    #define IN_PWM0__LOW					 0b0000000000000000	// Pin reads L (default) Also active for DIR_PWM0 =1 (reading back driven value).
    #define IN_PWM0__HIGH					 0b0000010000000000	// Pin reads H 
extern const subreg_item  GPIO__PWM_PWM0; 							// RW - PWM 0 enable PWM function
    #define PWM_PWM0__DISABLE				 0b0000000000000000	// No PWM function (default) 
    #define PWM_PWM0__ENABLE				 0b0000100000000000	// If DIR_PWM0= 1, then PWM output regarding PWM_GPIO register and OUT_PWM0 is ignored. If DIR_PWM0= 0, GPIO inputand no PWM function.
extern const subreg_item  GPIO__OUT_PWM0; 							// RW - PWM 0 Output Setting
    #define OUT_PWM0__LOW					 0b0000000000000000	// Drive L (default) 
    #define OUT_PWM0__HIGH					 0b0001000000000000	// Drive H 
extern const subreg_item  GPIO__DIR_PWM0; 							// RW - PWM 0 direction
    #define DIR_PWM0__INPUT					 0b0000000000000000	// Input (output stage = HiZ) (default) 
    #define DIR_PWM0__OUTPUT				 0b0010000000000000	// Output (output stage enabled) 
extern const subreg_item  GPIO__VIO_UV; 							// ROCW - VIO undervoltage error
    #define VIO_UV__NO_ERR					 0b0000000000000000	// No VIO undervoltage error (default) 
    #define VIO_UV__ERR						 0b1000000000000000	// VIO undervoltage error occurred 

// GPIO_PWM - 0038H PWM settings
extern const subreg_item  GPIO_PWM__PWM_DUTY_CYCLE; 				// RW - PWM duty cycle 0 - 100%
    #define PWM_DUTY_CYCLE__OFF				 0b0000000000000000	// No PWM (default) 
    #define PWM_DUTY_CYCLE__3_5				 0b0000000000000001	// 3.57% 
    #define PWM_DUTY_CYCLE__7_1				 0b0000000000000010	// 7.14% 
    #define PWM_DUTY_CYCLE__100				 0b0000000000011100	// 100% 
    #define PWM_DUTY_CYCLE__100_			 0b0000000000011111	// 100% 
extern const subreg_item  GPIO_PWM__PWM_PERIOD; 					// RW - PWM period time setting 2µs - 62µs
    #define PWM_PERIOD__OFF					 0b0000000000000000	// No PWM (default) 
    #define PWM_PERIOD__2us					 0b0000000100000000	// 2µs 
    #define PWM_PERIOD__4us					 0b0000001000000000	// 4 µs 
    #define PWM_PERIOD__62us				 0b0001111100000000	// 62µs 

