Infineon/IMR_PSoC6_BMS/proj_cm4/BMS_TLE9012/tle9012_registers.h
// ICVID - 0039H IC version and manufacturing ID
extern const subreg_item  ICVID__VERSION_ID; 						// RH - Version ID Read only version ID.
    #define VERSION_ID__DEFAULT				 0b0000000001000000	// Default 
extern const subreg_item  ICVID__MANUFACTURER_ID; 					// RH - Manufacturer ID Read only manufacture ID.
    #define MANUFACTURER_ID__DEFAULT		 0b1100000100000000	// Default 

// MAILBOX - 003AH Mailbox register
extern const subreg_item  MAILBOX__DATA; 							// RW - Data storage register 2 data byte data storage

// CUSTOMER_ID_0 - 003BH Customer ID 0
extern const subreg_item  CUSTOMER_ID_0__DATA; 						// RH - Unique ID part 1

// CUSTOMER_ID_1 - 003CH Customer ID 1
extern const subreg_item  CUSTOMER_ID_1__DATA; 						// RH - Unique ID part 2

// WDOG_CNT - 003DH Watchdog counter
extern const subreg_item  WDOG_CNT__WD_CNT; 						// RWH - Watchdog counter
    #define WD_CNT__SLEEP					 0b0000000000000000	// Device goes to sleep 
    #define WD_CNT__1						 0b0000000000000001	// tWD_LSB (EXT_WD = 0) / tWD_EXT_LSB (EXT_WD = 1 ) 
    #define WD_CNT__127						 0b0000000001111111	// tWD_LSB * 127 (EXT_WD = 0) / tWD_EXT_LSB * 127 (EXT_WD = 1) (default) 
extern const subreg_item  WDOG_CNT__MAIN_CNT; 						// RH - Main counter Used to enable host controller to measure the main oscillatorfrequency. LSB = t Count_LSB. Reset by write access to WD_CNT ifRR_SYNC=1.
    #define MAIN_CNT__DEFAULT				 0b0000000000000000	// Default 

// SCVM_CONFIG - 003EH SCVM configuration
extern const subreg_item  SCVM_CONFIG__EN_SCVMi; 					// RW - Enable SCVM for cell i
    #define EN_SCVMi__DIS					 0b0000000000000000	// SCVM disabled 
    #define EN_SCVMi__EN					 0b0000100000000000	// SCVM enabled (default) 

// STRESS_AUX - 003FH Stress correction AUX
extern const subreg_item  STRESS_AUX__STRESS_CORRECTION; 			// RH - Stress correction value PCVM
    #define STRESS_CORRECTION__DEFAULT		 0b0000000000000000	// Default 

// BAL_PWM - 005BH Balancing PWM
extern const subreg_item  BAL_PWM__BAL_PWM; 						// RW - PWM balancing, starts with off-phase
    #define BAL_PWM__VAL_0					 0b0000000000000000	// 100% duty cycle (function disabled) 
    #define BAL_PWM__VAL_1					 0b0000000000000001	// 87,5% duty cycle 
    #define BAL_PWM__VAL_7					 0b0000000000000111	// 12.5% duty cycle 

// BAL_CNT_0 - 005CH Balancing counter register 0
extern const subreg_item  BAL_CNT_0__BAL_CNT_0; 					// RW - Balancing counter to switch off balancing after a certain time, counter is (re-)started by a write access to WDOG_CNT when EXT_WD=1.
    #define BAL_CNT_0__VAL_1				 0b0000000000000001	// 7.5 min 
    #define BAL_CNT_0__VAL_31				 0b0000000000011111	// 3.87 h 
extern const subreg_item  BAL_CNT_0__BAL_CNT_1; 					// RW - Balancing counter to switch off balancing after a certain time, counter is (re-)started by a write access to WDOG_CNT when EXT_WD=1.
    #define BAL_CNT_1__VAL_1				 0b0000000000100000	// 7.5 min 
    #define BAL_CNT_1__VAL_31				 0b0000001111100000	// 3.87 h 
extern const subreg_item  BAL_CNT_0__BAL_CNT_2; 					// RW - Balancing counter to switch off balancing after a certain time, counter is (re-)started by a write access to WDOG_CNT when EXT_WD=1.
    #define BAL_CNT_2__VAL_1				 0b0000010000000000	// 7.5 min 
    #define BAL_CNT_2__VAL_31				 0b0111110000000000	// 3.87 h 

// BAL_CNT_1 - 005DH Balancing counter register 1
extern const subreg_item  BAL_CNT_1__BAL_CNT_3; 					// RW - Balancing counter to switch off balancing after a certain time, counter is (re-)started by a write access to WDOG_CNT when EXT_WD=1.
    #define BAL_CNT_3__VAL_1				 0b0000000000000001	// 7.5 min 
    #define BAL_CNT_3__VAL_31				 0b0000000000011111	// 3.87 h 
extern const subreg_item  BAL_CNT_1__BAL_CNT_4; 					// RW - Balancing counter to switch off balancing after a certain time, counter is (re-)started by a write access to WDOG_CNT when EXT_WD=1.
    #define BAL_CNT_4__VAL_1				 0b0000000000100000	// 7.5 min 
    #define BAL_CNT_4__VAL_31				 0b0000001111100000	// 3.87 h 
extern const subreg_item  BAL_CNT_1__BAL_CNT_5; 					// RW - Balancing counter to switch off balancing after a certain time, counter is (re-)started by a write access to WDOG_CNT when EXT_WD=1.
    #define BAL_CNT_5__VAL_1				 0b0000010000000000	// 7.5 min 
    #define BAL_CNT_5__VAL_31				 0b0111110000000000	// 3.87 h 

// BAL_CNT_2 - 005EH Balancing counter register 2
extern const subreg_item  BAL_CNT_2__BAL_CNT_6; 					// RW - Balancing counter to switch off balancing after a certain time, counter is (re-)started by a write access to WDOG_CNT when EXT_WD=1.
    #define BAL_CNT_6__VAL_1				 0b0000000000000001	// 7.5 min 
    #define BAL_CNT_6__VAL_31				 0b0000000000011111	// 3.87 h 
extern const subreg_item  BAL_CNT_2__BAL_CNT_7; 					// RW - Balancing counter to switch off balancing after a certain time, counter is (re-)started by a write access to WDOG_CNT when EXT_WD=1.
    #define BAL_CNT_7__VAL_1				 0b0000000000100000	// 7.5 min 
    #define BAL_CNT_7__VAL_31				 0b0000001111100000	// 3.87 h 
extern const subreg_item  BAL_CNT_2__BAL_CNT_8; 					// RW - Balancing counter to switch off balancing after a certain time, counter is (re-)started by a write access to WDOG_CNT when EXT_WD=1.
    #define BAL_CNT_8__VAL_1				 0b0000010000000000	// 7.5 min 
    #define BAL_CNT_8__VAL_31				 0b0111110000000000	// 3.87 h 

// BAL_CNT_3 - 005FH Balancing counter register 3
extern const subreg_item  BAL_CNT_3__BAL_CNT_9; 					// RW - Balancing counter to switch off balancing after a certain time, counter is (re-)started by a write access to WDOG_CNT when EXT_WD=1.
    #define BAL_CNT_9__VAL_1				 0b0000000000000001	// 7.5 min 
    #define BAL_CNT_9__VAL_31				 0b0000000000011111	// 3.87 h 
extern const subreg_item  BAL_CNT_3__BAL_CNT_10; 					// RW - Balancing counter to switch off balancing after a certain time, counter is (re-)started by a write access to WDOG_CNT when EXT_WD=1.
    #define BAL_CNT_10__VAL_1				 0b0000000000100000	// 7.5 min 
    #define BAL_CNT_10__VAL_31				 0b0000001111100000	// 3.87 h 
extern const subreg_item  BAL_CNT_3__BAL_CNT_11; 					// RW - Balancing counter to switch off balancing after a certain time, counter is (re-)started by a write access to WDOG_CNT when EXT_WD=1.
    #define BAL_CNT_11__VAL_1				 0b0000010000000000	// 7.5 min 
    #define BAL_CNT_11__VAL_31				 0b0111110000000000	// 3.87 h 


//****************************************************************************
// Special combinations of settings
//****************************************************************************
// Mask of all GEN_DIAG flags that are read only
#define GEN_DIAG_READ_ONLY_FLAGS (uint16_t)(UART_WAKEUP__UART | MOT_MOB_N__TOP | BAL_ACTIVE__ON | LOCK_MEAS__MEAS_ON | RR_ACTIVE__ON)
// Mask of all GEN_DIAG flags that are can be reset by writing 0
#define GEN_DIAG_RESETABLE_FLAGS (uint16_t)(~((uint16)GEN_DIAG_READ_ONLY_FLAGS))

//****************************************************************************
// Function prototypes
//****************************************************************************
void setRegisterCacheDataByIndex_tle9012(uint8_t nodeID, uint8_t reg_index, uint16_t reg_data);
uint16_t getRegisterCacheDataByIndex_tle9012(uint8_t nodeID, uint8_t reg_num);

void sendWrite(tle9012_node* node, uint8_t reg_address, uint16_t data, uint8_t isBroadcast);
void sendRead(tle9012_node* node, uint8_t reg_address, uint8_t isBroadcast);

void sendWatchdogUpdate(uint8_t nodeID, uint8_t isBroadcast);

