Infineon/IMR_PSoC6_BMS/proj_cm4/BMS_TLE9012/tle9012_registers.h
void setConfigBit_tle9012(uint8_t nodeID, uint8_t state, uint8_t reg_index, uint16_t bit, uint8_t blocking, uint8_t isBroadcast);
void setBits_tle9012(uint8_t nodeID, uint8_t reg_index, uint16_t bitmask, uint8_t blocking, uint8_t isBroadcast);
void clearBits_tle9012(uint8_t nodeID, uint8_t reg_index, uint16_t bitmask, uint8_t blocking, uint8_t isBroadcast);


//****************************************************************************
// Register ready/error bitmap - Every bit of these maps represents if the
// related register index is ready and without error
//		if command is queued - ready is set to 0 until result has been received or timeout occurred
//		if command failed or CRC was not correct - the error bit is set
//****************************************************************************
uint8_t checkRegisterReady_tle9012(uint8_t nodeID, uint8_t reg_index, uint8_t isBroadcast);
void setRegisterReady_tle9012(uint8_t nodeID, uint8_t reg_index, uint8_t isBroadcast);
void resetRegisterReady_tle9012(uint8_t nodeID, uint8_t reg_index, uint8_t isBroadcast);
uint8_t checkRegisterError_tle9012(uint8_t nodeID, uint8_t reg_index, uint8_t isBroadcast);
void setRegisterError_tle9012(uint8_t nodeID, uint8_t reg_index, uint8_t isBroadcast);
void resetRegisterError_tle9012(uint8_t nodeID, uint8_t reg_index, uint8_t isBroadcast);
uint8_t checkRegisterQueued_tle9012(uint8_t nodeID, uint8_t reg_index, uint8_t isBroadcast);
void setRegisterQueued_tle9012(uint8_t nodeID, uint8_t reg_index, uint8_t isBroadcast);
void resetRegisterQueued_tle9012(uint8_t nodeID, uint8_t reg_index, uint8_t isBroadcast);


//****************************************************************************
// getRegisterIndexFromAddress
//
// Converts a register address to the correlating register index.
// WARNING: Usage should be kept at an minimum because this transition takes
// much more resources than direct index access. Needed primarily when receiving
// packages where only address is given.
//
// Returns the index if it is found or 255 if not (error)
//****************************************************************************
static inline uint8_t getRegisterIndexFromAddress(uint8_t reg_address) {
	uint8_t i = 0;
	// Go through each register index and check if address is found
	do{
		// If address is found return the index
		if(reg_items[i].address == reg_address) return i;
		i++;
	}while(i < NUM_REGISTERS);

	// The given address was not found return 255 to indicate error
	return 255;

	// Use this simulation for unit testing - comment all above
	//return reg_address;
}





#endif /* TLE9012_REGISTERS_H__ */

